In [5]:
import nltk
nltk.__version__

'3.4.5'

In [7]:
import konlpy
konlpy.__version__

'0.5.1'

In [8]:
import pandas as pd

# 시리즈
- 1차원 배열의 값에 인덱스를 부여하는 구조

In [10]:
sr = pd.Series([17000, 18000, 1000, 5000],
              index=['피자', '치킨', '콜라', '맥주'])
print(sr)

피자    17000
치킨    18000
콜라     1000
맥주     5000
dtype: int64

In [12]:
print(sr.values)
print(sr.index)

[17000 18000  1000  5000]
Index(['피자', '치킨', '콜라', '맥주'], dtype='object')

# 데이터프레임(DataFrame)
- 데이터프레임은 2차원 리스트를 매개변수로 전달
- 행방향 : 인덱스, 열방향 : 컬럼
- 열(columns), 인덱스(index), 값(values)로 구성
* 시리즈는 인덱스(index), 값(values)로 구성

In [13]:
values = [[1,2,3],[4,5,6],[7,8,9]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C']

df = pd.DataFrame(values, index=index, columns=columns)
print(df)

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [16]:
print(df.index)
print(df.columns)
print(df.values)

Index(['one', 'two', 'three'], dtype='object')
Index(['A', 'B', 'C'], dtype='object')
[[1 2 3]
 [4 5 6]
 [7 8 9]]

# 데이터프레임 활용
- 생성, 조회

In [25]:
#리스트 --> 데이터프레임
data = [['1000', 'Steve', 90.72],
        ['1001', 'James', 78.09],
        ['1002', 'Doyeon', 98.43], 
        ['1003', 'Jane', 64.19],
        ['1004', 'Pilwoong', 81.30],
        ['1005', 'Tony', 99.14]]
data

[['1000', 'Steve', 90.72],
 ['1001', 'James', 78.09],
 ['1002', 'Doyeon', 98.43],
 ['1003', 'Jane', 64.19],
 ['1004', 'Pilwoong', 81.3],
 ['1005', 'Tony', 99.14]]

In [29]:
df = pd.DataFrame(data)
df

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [31]:
#데이터프레임 열지정
df = pd.DataFrame(data, columns=['학번', '이름', '점수'])
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [33]:
#딕셔너리 --> 데이터프레임
data = { '학번' : ['1000', '1001', '1002', '1003', '1004', '1005'],
        '이름' : [ 'Steve', 'James', 'Doyeon', 'Jane', 'Pilwoong', 'Tony'],
        '점수': [90.72, 78.09, 98.43, 64.19, 81.30, 99.14]}
data

{'학번': ['1000', '1001', '1002', '1003', '1004', '1005'],
 '이름': ['Steve', 'James', 'Doyeon', 'Jane', 'Pilwoong', 'Tony'],
 '점수': [90.72, 78.09, 98.43, 64.19, 81.3, 99.14]}

In [34]:
df = pd.DataFrame(data)
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

- 데이터프레임 조회
- df.head(n):앞 부분 n개만 보기
- df.tail(n):뒷 부분 n개만 보기
- df['열이름']:해당되는 열을 확인

In [35]:
df.head(3)

     학번      이름     점수
0  1000   Steve  90.72
1  1001   James  78.09
2  1002  Doyeon  98.43

In [36]:
df.tail(3)

     학번        이름     점수
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [37]:
df['학번']

0    1000
1    1001
2    1002
3    1003
4    1004
5    1005
Name: 학번, dtype: object

In [42]:
#외부 데이터 읽기 생성
#csv파일 읽기
df = pd.read_csv('C:/Users/fxk/PycharmProjects/tenjumh\Study/NLP_Natural Language Processing/example.csv')
df

   student id name  score
0        1000    A  96.40
1        1001    B  64.40
2        1002    C  59.32
3        1003    D  90.43
4        1004    E  64.32
5        1005    F  86.31

In [43]:
print(df.index)

RangeIndex(start=0, stop=6, step=1)